import pandas as pd  # Подключаем библиотеку pandas для создания таблицы
# Создаем названия колонок и обычный пустой список для книги
columns = ["ФИО", "Адрес", "Телефон", "Дата рождения"]
book = []  # Это список, куда мы будем складывать наши контакты
#Запускаем цикл с меню, чтобы программа не закрывалась сама
while True:
    print("адресная книга")
    print("1. Показать контакты")
    print("2. Добавить контакт")
    print("3. Изменить контакт")
    print("4. Удалить контакт")
    print("5. Выйти")
    action = input("Выберите номер действия: ")
    if action not in ["1", "2", "3", "4", "5"]:#проверяем на диапазон
        print("вы вышли из диапазона,попробуйте еще раз:")
        continue
    if action == "1":
        #проверяем контакты,если они сравнимы с нулем,то книга пуста
        if len(book) == 0:
            print("Книга еще пустая!")
        else:
            df = pd.DataFrame(book, columns=columns)#Показываем список с номерами, чтобы пользователь выбрал нужный
            print(df)
    elif action == "2":#если выбрали 2,то изменяем список
        f = input("Введите ФИО: ")
        a = input("Введите Адрес: ")
        p = input("Введите Телефон: ")
        b = input("Введите Дата рождения: ")
        # Собираем данные в список 
        new_contact = [f, a, p, b]
        book.append(new_contact)  # Команда append добавляет контакт в конец нашей книги
        print("Контакт добавлен!")
    elif action == "3":#если выбрал 3
        if len(book) == 0:#сравнимо с нулем,значит нету контактов
            print("Нечего изменять, книга пустая!")
        else:
            # Показываем список с номерами, чтобы пользователь выбрал нужный
            df = pd.DataFrame(book, columns=columns)
            print(df)
            num = int(input("Введите номер строки для изменения: "))
            # Просим ввести полностью новые данные для этого контакта
            nf = input("Новое ФИО: ")
            na = input("Новый Адрес: ")
            np = input("Новый Телефон: ")
            nb = input("Новая Дата рождения: ")
            # Собираем все новые переменные в один свежий список
            new2_contact = [nf, na, np,nb]
            # Заменяем старую строку в книге по её номеру на наш новый список
            book[num] = new2_contact
            print("Данные изменены!")
    elif action == "4":
        if len(book) == 0:#если сравнимо с 0,то нечего удалять
            print("Нечего удалять, книга пустая!")
        else:
            df = pd.DataFrame(book, columns=columns)#Показываем список с номерами, чтобы пользователь выбрал нужный
            print(df)
            num = int(input("Введите номер строки для удаления: "))
            #команда pop  удаляет элемент из списка по его номеру
            book.pop(num)
            print("Контакт успешно удален!")
    elif action == "5":
        print("Пока!")
        break  # Останавливаем цикл while
