import matplotlib.pyplot as plt #используем библиотеку, для рисования графиков.
import numpy as np  # используем для вычислений

# задаем X от 1 до 5 с помощью функции np.array()
x = np.array([1, 2, 3, 4, 5])# Превращаем обычный список чисел в массив NumPy для быстрых расчетов
# считаем y для х
y_x2 = x ** 2     
y_ex = np.exp(x)# применяем специальную команду для рассчета значения e**х
y_ln = np.log(x)# применяем специальную команду для рассчета логарифма
y_x3 = x ** 3 
# 3. Рисуем графики
plt.figure("графики")

plt.plot(x, y_x2, color='red', marker='o', label='x^2')# Рисуем x**2: цвет красный, точки — кружочки
plt.plot(x, y_ex, color='blue', marker='x', label='e^x')#Рисуем e**x: цвет синий, точки — крестики
plt.plot(x, y_ln, color='green', marker='s', label='ln(x)')#Рисуем ln(x): цвет зеленый, точки — квадраты
plt.plot(x, y_x3, color='orange', marker='^', label='x^3')# Рисуем x^3: цвет оранжевый, точки — треугольники
# Подписываем горизонтальную и вертикальную оси
plt.xlabel("Ось X")
plt.ylabel("Ось Y")
plt.title("Графики функций")#  заголовок
plt.grid(True)#сетка
plt.show()#=Выводим готовое окно с графиками на экран