import random #мы берём из памяти Python встроенный инструмент random. Он нужен, чтобы компьютер мог сам придумывать случайные числа.
import numpy as np #используем эту библиотеку,чтобы решать сложные математические расчеты.Дадим ей короткое имя np.
N = int(input("Введите количество строк (N): "))#спрашиваем размеры матрицы
M = int(input("Введите количество столбцов (M): "))

# 2. Создаем пустую матрицу и заполняем её случайными числами
matrix = [] # пустой список, куда будем складывать наши строки с рандомными числами.
#Запускаем цикл для создания строк. Переменная i хранит номер текущей строки (от 0 до N-1).
for i in range(N):
    row = [] #Каждый раз создаем абсолютно новую строку с нуля, чтобы данные не перезаписывали друг на друга
    #Внутренний цикл: переменная j считает элементы,чтобы ввести в строку
    for j in range(M):
        # Генерируем случайное число от 1 до 9
        number = random.randint(1, 9)
        row.append(number) #Добавляем каждый новый  элемент в конец текущей строки row
    matrix.append(row) #Помещаем готовую строку в главный список matrix

#Выводим исходную матрицу на экран построчно
print("Исходная матрица")
# Перебираем по очереди каждую строку из большой матрицы
for row in matrix:
    print(row) # Выводим

#Делаем транспонированную матрицу
t_matrix = [] #делаем пустой список для будущей транспонированной матрицы
for j in range(M):# j теперь идет не по строкам, а по столбцам исходной матрицы (M)
    new_row = [] # Создаем чистую строку, куда будем собирать числа для новой матрицы
    for i in range(N): # i теперь  идет по строкам исходной матрицы (N)
        # Берем число из старой матрицы по координатам [i][j] и добавляем в новую строку.
        # За счет этого бывший столбец ложится горизонтально и становится строкой.
        new_row.append(matrix[i][j])
    t_matrix.append(new_row)#Добавляем готовую перевернутую строку в нашу новую матрицу

#Выводим транспонированную матрицу на экран построчно
print("Транспонированная матрица")
for row in t_matrix:
    print(row) #выводим
# Считаем определитель, если матрица квадратная
if N == M:
    #Считаем определитель для первой и второй матрицы.
    # Для этого используем встроенную команду np.linalg.det, которая делает рассчеты
    det1 = np.linalg.det(matrix)
    det2 = np.linalg.det(t_matrix)
    print("Определитель исходной:", det1)
    print("Определитель транспонированной:", det2)
    # Сравниваем
    if det1 == det2:
        print("Результат: Определители равны!")
    else:
        print("Результат: Определители не равны.")
else:
    print("Матрица не квадратная, определитель посчитать нельзя.")